{"Introduction":"<section><h3>Welcome to Alana's CONT 564 Junior ABQ Portfolio!</h3>\n<p class=\"pull-right\"><img src=\"portfolio-picture.thumb.jpg\" alt=\"Portfolio Picture\"></p>\n<p>Here you will find assignments that correspond to the Five Standards of Practice as outlined by the Ontario College of Teachers:</p>\n<ol>\n<li>Commitment to Students and Student Learning</li>\n<li>Leadership in the Learning Community</li>\n<li>Ongoing Professional Learning</li>\n<li>Professional Knowledge</li>\n<li>Professional Practice</li>\n</ol>\n<p>Feel free to use the navigation at the top of the page to look around. I hope that my portfolio accurately represents the many positive experiences I gained throughout the course.</p>\n</section>","Commitment to Students and Student Learning":{"Effective Classroom Strategies":"<section><h3>The Junior Classroom</h3>\n<p>The atmosphere that you create in your classroom can have a huge impact on the emotional, social, physical and intellectual development of your junior students. A well-organized and thoughtfully designed classroom will promote positive attitudes toward school and learning. Classrooms with this atmosphere also enable teachers to observe, support and meet learning needs of each student.</p>\n<h3>Effective Classroom Strategies Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"ecsdp-clps\"> <label for=\"ecsdp-clps\">Display task description</label>\n<blockquote>\n<p>Review the ministry guides, watch video clips shared, look at the ministry website for information and locate articles on the effective junior classroom. From this information, create a list of 8-10 essential strategies.</p>\n</blockquote>\n</div>\n<ol>\n<li><b><i>Use pictures, graphics and storyboards.</i></b> <br> When teachers use pictures and graphics more often, students write with more detail, retain more information, and get better grades on written work across the curriculum.</li>\n<li><b><i>Provide competitive learning opportunities.</i></b> <br>Competitive learning includes classroom debates, content-related games, and goal-oriented activities.</li>\n<li><b><i>Let students choose some of their reading and writing themselves.</i></b> <br>Regularly including nontraditional materials, such as graphic novels, magazines, and comic books, increases engagement in reading and improves writing.</li>\n<li><b><i>Move around the classroom as you teach.</i></b> <br>Physical movement increases engagement, while also being able to monitor progress and keep disruptions at a minimum.</li>\n<li><b><i>Allow students to move around as needed in classrooms.</i></b> <br>This strategy is especially useful when reading or writing—when certain students twitch, tap their feet, stand up, or pace, they are often learning better than if they sit still.</li>\n<li><b><i>Use hand signals and other non-verbal gestures.</i></b> <br>Hand signals such as holding one hand in the air and wait for them to put their hand up as well as well as non-verbal gestures such as flicking the lights off and on once can be beneficial in getting your students’ attention quickly and efficiently.</li>\n<li><b><i>Address behaviour problems quickly and wisely.</i></b> <br>A problem between two students can quickly escalate from a molehill to a mountain, so it’s a good idea to solve any issues quickly before they get out of hand. As for handling the problem wisely, bring the students away from the rest of the class and never accuse the child of anything.</li>\n<li><b><i>Use your normal and natural voice.</i></b> <br>Avoid raising your voice to get your students’ attention as you are more likely to lose your voice and students will often mimic the voice level you use. Also, use different tones of voice depending on what you are requesting of the students (ex - directions vs question).</li>\n</ol>\n</section>","Implementing Principles of Assessment":"<section><h3>The Seven Fundamental Principles of Assessment, Evaluation and Reporting</h3>\n<p>According to <a href=\"http://www.edu.gov.on.ca/eng/policyfunding/growSuccess.pdf#page=12\"><em>Growing Success</em></a>,</p>\n<blockquote>\n<p>to ensure that assessment, evaluation, and reporting are valid and reliable, and they they lead to the improvement of learning for all students, teachers use practices and procedures that:</p>\n<ul>\n<li>are fair, transparent, and equitable for all students;</li>\n<li>support all students, including those with special education needs, those who are learning the language of instruction, and those who are First Nation, Métis, or Inuit;</li>\n<li>are carefully planned to relate to the curriculum expectations and learning goals and, as much as possible, to the interests, learning styles and preference, needs, and experiences of all students;</li>\n<li>are communicated clearly to students and parents at the beginning of the school year or course and at other appropriate points throughout the school year or course;</li>\n<li>are ongoing, varied in nature, and administered over a period of time to provide multiple opportunities for students to demonstrate the full range of their learning;</li>\n<li>provide ongoing descriptive feedback that is clear, specific, meaningful, and timely to support improved learning and achievement;</li>\n<li>develop students’ self-assessment skills to enable them to assess their own learning, set specific goals and plan next steps for their learning.</li>\n</ul>\n</blockquote>\n<h3>Principles of Assessment Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"poadp-clps\"> <label for=\"poadp-clps\">Display task description</label>\n<blockquote>\n<p>Read the resources below and reflect on the Seven Fundamental Principles of Assessment. Then select three principles of assessment and evaluation and suggest practical ways of implementing them in the junior classroom.</p>\n<p>Resources:</p>\n<ul>\n<li><a href=\"http://www.edu.gov.on.ca/eng/policyfunding/growSuccess.pdf#page=12\">Growing Success</a> (pg 6, 15-26, 27-36)</li>\n<li><a href=\"teamwork-self-and-peer-evaluation-rubric.pdf\">Peer Feedback Sample #1</a></li>\n<li><a href=\"http://www.bcrpa.bc.ca/recreation_parks/aquatics/pdf/TwoStars_and_a_wish_appraisal_form.pdf\">Peer Feedback Sample #2</a></li>\n</ul>\n</blockquote>\n</div>\n<p>I chose the following three (3) principles of assessment to discuss.</p>\n<ol>\n<li>\n<h4>provide ongoing descriptive feedback that is clear, specific, meaningful, and timely to support improved learning and achievement</h4>\n<p>What I find effective is to group students together who received similar assessment notes and then have a conference with these students. Grouping students who would benefit from similar suggestions can reduce the amount of time you have to spend discussing the feedback. I believe that if you are consistent and clear with your feedback, your students will better understand and predict your expectations.</p>\n</li>\n<li>\n<h4>are carefully planned to relate to the curriculum expectations and learning goals and, as much as possible, to the interests, learning styles and preference, needs, and experiences of all students</h4>\n<p>Once you’ve chosen the expectation that you’d like to assess, create a few assignments that students can choose from to demonstrate their knowledge. Giving students a choice between different assessments makes it easier to engage them and also allows them to gravitate towards a preference that suits them.</p>\n</li>\n<li>\n<h4>are communicated clearly to students and parents at the beginning of the school year or course and at other appropriate points throughout the school year or course</h4>\n<p>It is important to keep communication up throughout the year in order to ensure that your students and their parents know what to expect. To apply this principle, teachers can implement the following means of communication:</p>\n<ul>\n<li>send home a monthly newsletter</li>\n<li>use agendas to communicate with parents</li>\n<li>have student conferences to help them assess their own learning</li>\n<li>post expectation charts around the classroom</li>\n<li>when giving an assignment, have the class discuss what would make them successful</li>\n<li>call parents periodically</li>\n<li>hand back assessments in an appropriate time frame</li>\n</ul>\n</li>\n</ol>\n</section>","Inclusive Literature":"<section><h3>Inclusive Literature Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"ildp-clps\"> <label for=\"ildp-clps\">Display task description</label>\n<blockquote>\n<p>Read page 6-7 of <a href=\"http://www.edu.gov.on.ca/eng/document/reports/literacy/panel/literacy.pdf\">Literacy for Learning: Report of the Expert Panel on Literacy, Grades 4-6 in Ontario</a>, December, 2004.</p>\n<p>Create a list of three storybooks that acknoledge and embrace diversity in all its forms (eg. multicultualism, gender stereotypes, etc.) that could be used in the classroom for a lesson (eg. as a read aloud or as a shared reading lesson). Include the following for each book in your list:</p>\n<ul>\n<li>The title, author, and grade level of the book</li>\n<li>A synopsis (1-2 sentences)</li>\n<li>A description of hte issues addressed ad the relevance of the book for the class (1-2 sentences)</li>\n</ul>\n</blockquote>\n</div>\n<ol>\n<li>\n<h4><em>Esperanza Rising</em> by Pam Munoz Ryan</h4>\n<p class=\"pull-right\"><img src=\"esperanza-rising.thumb.jpg\" alt=\"Esperanza Rising Front Cover\"></p>\n<p><em>Grade Level:</em> 4+</p>\n<p><em>Synopsis:</em> It is 1930, and Esperanza is watching the workers on her father’s huge ranch harvest the grapes. Esperanza doesn’t realize it, but soon she will be working as hard as them. Her life is torn apart when her father is killed. Driven from their beautiful home in Mexico, Esperanza and her mother start over in a camp for farm workers in California. It is here where Esperanza must learn to rise again.</p>\n<p><em>Issues addressed:</em> Immigration, starting over in a new place. This book can spark conversation about what it means to immigrate and how hard it is to adapt to a new setting.</p>\n</li>\n<li>\n<h4><em>Good Night, Commander</em> by Ahmad Akbarpour</h4>\n<p class=\"pull-right\"><img src=\"good-night-commander.thumb.jpg\" alt=\"Good Night, Commander Front Cover\"></p>\n<p><em>Grade Level:</em> 3-6</p>\n<p><em>Synopsis:</em> A young boy who has lost his leg - and his mother - in the war acts out imaginary battles against his enemies, seeking revenge, until he sees that the enemy is young, too, and also has experienced loss.</p>\n<p><em>Issues addressed:</em> Students with disabilities, dealing with loss. This book can ignite a discussion about how it feels to lose something very dear to you.</p>\n</li>\n<li>\n<h4><em>The Boy in the Dress</em> by David Williams</h4>\n<p class=\"pull-right\"><img src=\"boy-in-the-dress.thumb.jpg\" alt=\"The Boy in the Dress Front Cover\"></p>\n<p><em>Grade Level:</em> 5-7</p>\n<p><em>Synopsis:</em> Dennis’s Dad is depressed since his Mom left and his brother is a bully. But at least he has soccer. Then he discovers he enjoys wearing a dress.</p>\n<p><em>Issues addressed:</em> Gender identity. This book can start a conversation about what “gender norms” are and what gender identity means.</p>\n</li>\n</ol>\n</section>","Junior Classroom Differentiation Strategies":"<section><h3>Differentiation Goals Assignment</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"dga-clps\"> <label for=\"dga-clps\">Display task description</label>\n<blockquote>\n<p>Read the following resources to get a better understanding of differentiated instruction:</p>\n<ul>\n<li><a href=\"http://www.edu.gov.on.ca/eng/general/elemsec/speced/LearningforAll2013.pdf#page=21\">Learning For All</a>, Figure 4. A Concept Map for Differentiating Instruction (p. 19), <em>Learning For All</em>, K to Grade 12, Draft Version, Ministry of Education, 2013</li>\n<li><a href=\"http://www.edugains.ca/resourcesDI/EducatorsPackages/DIEducatorsPackage2010/2010EducatorsGuide.pdf\">Differentiated Instruction Educator's Package</a>, A Differentiated Instruction Implementation Continuum (p. 6), <em>Student Success: Differentiated Instruction Educators’ Package (2010)</em>, Ministry of Education and Training</li>\n<li>An Inclusive Classroom Experience, <em>Creating a Dynamic Classroom</em> (p. 27-37), A Handbook for Teachers (COURSE TEXT)</li>\n<li>Understanding How Children Learn and Develop, <em>Creating a Dynamic Classroom</em> (p. 71-73), A Handbook for Teachers (COURSE TEXT)</li>\n</ul>\n<p>Using this information, identify three differentiation strategies you might use in a junior classroom to help all students be successful learners. Include a brief strategy and its usefulness.</p>\n</blockquote>\n</div>\n<ol>\n<li>\n<h4>Use various types of media.</h4>\n<p>Using different types of media is a great tool for educators to use. First of all, it keeps students interested because it’s not always the same activies/lessons when they come into class. Teachers can use media such as radio, television, movies, magazines, books, iPad apps, etc. in order to better to engage students.</p>\n</li>\n<li>\n<h4>Create instructional activities using multiple intelligences (logical, mathematical, musical, intrapersonal, etc).</h4>\n<p>It is important that teachers learn and observe their students learning methods and personalities in order to best plan their lessons. Incorporating activities that all students can excel doing is important for each student’s achievement and confidence.</p>\n</li>\n<li>\n<h4>Give students a choice in learning and assessment activities.</h4>\n<p>Students who have an opinion about how they learn are more likely to be fully engaged in their learning.  Also, students who have a choice are less likely to act out during class since they are given more responsibility and want to keep those benefits.</p>\n</li>\n</ol>\n</section>","Useful Feedback":"<section><h3>Useful Feedback Discussion Post &amp; T-Chart</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"ufdpt-clps\"> <label for=\"ufdpt-clps\">Display task description</label>\n<blockquote>\n<p>One very important feature of formative assessment is the type of feedback the student receives as they are learning. Often phrases of &quot;good job&quot; and &quot;keep going&quot; are heard in classrooms. These types of phrases, while encouraging, provide no information for students to understand what they have done well or what they need to improve in order to be successful.</p>\n<p>Complete a T-Chart that lists familiar &quot;throw-away&quot; phrases often heard in classrooms. (Throw-away phrases are those that do not provide information to the learner). On the other side of the T-chart, provide alternative feedback comments that would be more useful to students.</p>\n<p>It is important that we give feedback that outlines student strengths, weaknesses and next steps. We also need to think about the knowledge and skills criteria from the Achievement Charts as it will help us focus on specific aspects of students’ work.\nWhen pointing out a weakness and next step, be sure the next step is attainable for the student. This is especially important for students who are on an IEP.</p>\n</blockquote>\n</div>\n<table class=\"tchart\">\n    <tr> \n        <th>Throw Away Phrase</th>\n        <th>Alternative Comment</th>\n    </tr>\n    <tr>\n        <td>Good job!</td>\n        <td>Good work on organizing your paragraph. Could you think of some descriptive words that would help a reader get a clear \"mind picture\" of how bad the storm really was?</td>\n    </tr>\n    <tr>\n        <td>Keep going!</td>\n        <td>You’ve done a great job outlining your news article. What do you think is the next step?</td>\n    </tr>\n    <tr>\n        <td>Nice work!</td>\n        <td>Your map of the solar sytem was drawn very well to scale. Can you think of some other details that you can add to it to make it more informative?</td>\n    </tr>\n    <tr>\n        <td>That looks good!</td>\n        <td>Your artwork turned out great! I enjoy the colours you chose for your painting. They really complemented each other well.</td>\n    </tr>\n    <tr>\n        <td>Well done!</td>\n        <td>Well done explaining your topic in the opening paragraph. For your next draft, make sure that your closing paragraph is just as strong.</td>\n    </tr>\n    <tr>\n        <td>Try again </td>\n        <td>This was a good first step. Try writing your assignment again and make sure that you use descriptive words and include all of the success criteria.</td>\n    </tr>\n</table>\n</section>"},"Leadership in the Learning Community":{"Developing Student Character":"<section><h3>Developing Character Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"dcdp-clps\"> <label for=\"dcdp-clps\">Display task description</label>\n<blockquote>\n<p>Consult three or four of the following resources on Character Education:</p>\n<ul>\n<li><a href=\"http://goodcharacter.com/\">Character Education – Free Resources, Materials, Lesson Plans</a></li>\n<li><a href=\"http://tribes.com/about/tribes-tlc-and-character-education/\">Character Education and Tribes Learning Communities</a></li>\n<li><a href=\"http://www.peace.ca/Character%20Education2.doc\">Character Education</a></li>\n<li><a href=\"http://search.ebscohost.com.proxy.queensu.ca/login.aspx?direct=true&amp;db=eue&amp;AN=14742629&amp;site=ehost-live\">Non-Threatening Classroom Environments</a>, by: Barker, Keith; Ross, Catherine; Thorne, Gillian. Teaching Professor, Nov2004, Vol. 18 Issue 9, 4-6.</li>\n<li><a href=\"http://search.ebscohost.com.proxy.queensu.ca/login.aspx?direct=true&amp;db=eue&amp;AN=508197113&amp;site=ehost-live\">The Leap into 4th Grade</a>. Anderson, M. (2011). Educational Leadership, 68(7), 32-6.</li>\n<li>Look at your school board and try to locate board and school initiatives that are about Character Education.</li>\n</ul>\n<p>Share one idea that you would use in a junior classroom to develop character in your students. Explain how you would do this. This could be in the form of a lesson, discussion, or an activity.</p>\n</blockquote>\n</div>\n<p class=\"pull-right\"><img src=\"Newspapers-and-magazines.thumb.jpg\" alt=\"Newspapers and Magazines\"></p>\n<p>The following would be used to teach students about <em>caring</em> behaviour.</p>\n<p>Bring in (or have your students bring in) articles from newspapers and magazines describing situations that show caring and uncaring actions on the part of individuals, groups or governments. Discuss in what ways do they demonstrate either caring or uncaring actions?</p>\n<p>To further the discussion, in groups or individually, students could write letters to the people involved in one of the articles.</p>\n</section>","EQAO Assessment":"<section><h3>EQAO Testing Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"eqao-tdp-clps\"> <label for=\"eqao-tdp-clps\">Display task description</label>\n<blockquote>\n<p>Visit the <a href=\"http://www.eqao.com/\">EQAO website</a>.</p>\n<p>Peruse the information found there, specifically, as it pertains to the junior level students. In particular, look at the area for educators.</p>\n<p>Read <a href=\"http://www.eqao.com/pdf_e/12/UnderstandingLevelsAchievemet_JuniorDivision_en.pdf\"><em>Understanding Levels of Achievement: Using EQAO Information to Improve Student Learning</em></a>.</p>\n<p>EQAO assessments provide information about students as learners. The purpose of this resource is to help classroom teachers make links between student work on EQAO Assessments in Reading, Writing an Math at the junior level and their classroom instruction and assessments.</p>\n<p>Questions:</p>\n<ol>\n<li>How could you use the information found in the document and on the EQAO site to your advantage?</li>\n<li>In regards to the Provincial Assessment, what other information is available at your board to help with this testing?</li>\n<li>How would you assist parents with understanding what you are doing in the classroom to better prepare students for testing?</li>\n</ol>\n<p>Summarize your response to the above questions and discuss how you can use EQAO results to support student learning in the classroom.</p>\n</blockquote>\n</div>\n<ol>\n<li>\n<p><strong><em>How could you use the information found in the document and on the EQAO site to your advantage?</em></strong></p>\n<p>The EQAO testing provides an assessment about each individual students to the parents and teachers. It can help identify in what areas of learning students need to improve. In order to better prepare your students for the testing, the EQAO website has available previous years' tests.</p>\n</li>\n<li>\n<p><strong><em>In regards to the Provincial Assessment, what other information is available at your board to help with this testing?</em></strong></p>\n<p>My board has the previous years' results readily available online. They also have information for parents explaining how they can help their child with preparation for the testing.</p>\n</li>\n<li>\n<p><strong><em>How would you assist parents with understanding what you are doing in the classroom to better prepare students for testing?</em></strong></p>\n<p>It is important to keep parents involved in the provincial testing preparation process. An easy way to do this is establishing a main method of communication at the beginning of the year such as email, newsletters or an online classroom management system. It is also important to keep the communication open throughout the year in order to inform parents of any struggles so that they can help their child at home.</p>\n</li>\n</ol>\n</section>","Planning and Assessment Brochure":"<section><h3>Parents as Partners</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"pap-clps\"> <label for=\"pap-clps\">Display task description</label>\n<blockquote>\n<p>Read Chapter 11 from the course text. Highlight those ideas you find particularly useful that you would use in the classroom.</p>\n<p>Using information from Chapter 11 and the two modules on planning and assessment, create a brochure for parents of your junior age children about Planning and Assessment. This brochure will increase parental understanding of how planning and assessment work together, and it will outline how you will keep parents informed about how their children are progressing.</p>\n</blockquote>\n</div>\n<p><iframe src=\"pdf.js/web/viewer.html?file=/brochure.pdf\" width=\"100%\" height=\"550px\"></iframe></p>\n</section>","Report Card Attributes":"<section><h3>Report Card Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"rcdp-clps\"> <label for=\"rcdp-clps\">Display task description</label>\n<blockquote>\n<p>Read pages 48-67 of the <a href=\"http://www.edu.gov.on.ca/eng/policyfunding/growSuccess.pdf#page=54\">Growing Success Document</a> to learn more about Reporting Student Achievement.</p>\n<p>View the Grade 1-6 progress report card and provincial report card templates <a href=\"http://www.edu.gov.on.ca/eng/document/forms/report/card/reportCard.html\">here</a>.</p>\n<p>Focusing on the Junior Level report card, highlight two or more positive aspects of the provincial report cards. Then highlight some areas of concern, some questions left unanswered or suggestions for future improvements with the report card.</p>\n</blockquote>\n</div>\n<p><strong><em>There are a number of positive aspects of the Provincial Report Card.</em></strong></p>\n<ol>\n<li>I think that it is important to highlight the Learning Skills by putting them on the first page along with a description of what each skill means. I feel like we should focus more on these skills because, in general, it is more important to be a person with these skills than a person with an &quot;A&quot; in a specific subject. They are obviously connected, but I think that if a student can demonstrate these Learning Skills, then the other will follow soon after.</li>\n<li>I also think that having the majority of space on the report card for teacher comments is important. While the mark received by the student is relevant, I think it is crucial for parents to understand that the teacher was thoughtful in deriving those marks, and the space for comments gives teachers the opportunity to make that clear.</li>\n</ol>\n<p><strong><em>However, there are also area of concerns for the Provincial Report Card.</em></strong></p>\n<ol>\n<li>I'm finding that when I look at the strands and subjects, it looks a little cluttered. With the checkboxes for ESL/ELD, IEP, etc. it looks pretty busy and a little messy. I'm wondering if there is another way to approach this without it looking crowded.</li>\n<li>Also, I'm wondering why for some subjects (Language, Math, Arts), there is strand-by-strand reporting, but for others (Science, Social Studies), there is not. I'm thinking that it might unintentionally (or intentionally) downplay the importance of some subject areas while promoting others. Or, maybe this is simply my interpretation.</li>\n</ol>\n</section>","Unit Success Criteria":"<section><h3>Success Criteria Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"scdp-clps\"> <label for=\"scdp-clps\">Display task description</label>\n<blockquote>\n<p>Think about your unit of study. Choose an area of your unit and develop 3-5 success criteria for it that you would want students to use to be successful.</p>\n</blockquote>\n</div>\n<p>These success criteria relate directly to the Grade 6 Space Unit in Science and Technology. They should be posted in a prominent location in the classroom, which will help students know what they are expected to learn and what they should be able to do when they have succeeded in learning the goals for the unit. Success criteria help give students an end goal for the lesson and unit.</p>\n<ul class=\"chart-writing\">\n<li>I will be able to identify the bodies in the solar system.</li>\n<li>I will be able to identify the bodies in the solar system that emit their own light.</li>\n<li>I will be able to identify how humans meet their biological needs while in space.</li>\n<li>I will be able to describe the effects of the motion of the Earth, Moon and Sun.</li>\n<li>I will understand the diverse ways in which Canadians have contributed to space exploration.</li>\n</ul>\n</section>"},"Ongoing Professional Learning":{"Aboriginal Education Strategy":"<section><h3>Aboriginal Perspectives</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"ap-clps\"> <label for=\"ap-clps\">Display task description</label>\n<blockquote>\n<p>There are many excellent general strategies suggested in the <em>Aboriginal Education Strategy Teacher’s Toolkit</em>. Read the guide to the toolkit, titled <a href=\"http://www.edu.gov.on.ca/eng/aboriginal/Guide_Toolkit2009.pdf\"><em>Aboriginal Perspectives: A Guide to the Teacher’s Toolkit</em></a>.</p>\n<p>The Aboriginal Education Strategy links practical teaching strategies to Language and Social Studies. Below you will find samples of teaching strategies intended to bring Aboriginal perspectives into the classroom.</p>\n<ul>\n<li><a href=\"who-says.pdf\">Grade 4 Language – Comparing Media Texts: Who Says?</a></li>\n<li><a href=\"exchanges.pdf\">Grade 4 Social Studies – Exchanges Between Communities</a></li>\n<li><a href=\"walking.pdf\">Grade 4 Social Studies – Walking in Someone Elses Shoes</a></li>\n<li><a href=\"heroes.pdf\">Grade 5 Language – Aboriginal Heroes</a></li>\n<li><a href=\"creation.pdf\">Grade 5 Language – Creation Stories – Where We All Come From</a></li>\n<li><a href=\"stereotypes.pdf\">Grade 5 Language – Stereotypes: Learning to Unlearn</a></li>\n<li><a href=\"circle.pdf\">Grade 5 Language – Talking Circle</a></li>\n<li><a href=\"celebrate.pdf\">Grade 5 Social Studies – Celebrating National Aboriginal Day</a></li>\n<li><a href=\"map.pdf\">Grade 5 Social Studies – Using and Making Maps</a></li>\n<li><a href=\"achievements.pdf\">Grade 6 Social Studies – Achievements of Aboriginal People in Canada</a></li>\n<li><a href=\"persepctives.pdf\">Grade 6 Social Studies – Current Aboriginal Perspectives</a></li>\n<li><a href=\"differences.pdf\">Grade 6 Social Studies – Different but Similar: Comparing Algonquian and Iroquoian Nations</a></li>\n<li><a href=\"issues.pdf\">Grade 6 Social Studies – Issues Concerning First Nations Today</a></li>\n</ul>\n<p>The following guides identify expectations in the elementary curriculum that provide opportunities to bring Aboriginal perspectives into the classroom.</p>\n<ul>\n<li><a href=\"exp4.pdf\">Expectations Grade 4</a></li>\n<li><a href=\"esp5.pdf\">Expectations Grade 5</a></li>\n<li><a href=\"exp6.pdf\">Expectations Grade 6</a></li>\n</ul>\n<p>Tailor one of the teaching strategies listed above in the Aboriginal Education Strategy to meet the needs of your junior classroom in a subject other than language or social studies.</p>\n</blockquote>\n</div>\n<h4>Aboriginal Teaching Strategy: Learning to Unlearn</h4>\n<ul>\n<li>This strategy could be used to teach a grade 5 visual arts lesson. The visual arts lesson would focus on the following specific expectations:</li>\n</ul>\n<h4>Specific Expectations</h4>\n<ul>\n<li><strong>D1.1</strong> demonstrate an understanding of composition, using selected principles of design to create narrative art works or art works on a theme or topic</li>\n<li><strong>D1.3</strong> use elements of design in art works to communicate ideas, messages, and understandings</li>\n<li><strong>D2.3</strong> demonstrate awareness of meaning of signs, symbols and styles in works of art</li>\n</ul>\n<h4>Procedure</h4>\n<ul>\n<li>With prompting, students make two minds maps - one things that are typically considered beautiful and one for things that are typically not. Students then share with their seating groups some of the ideas that they came up with. Then, using their mind maps and conversations as guides, the students will pick at least one item to draw. However, they will not draw it as it is seen normally, but instead they will create a drawing that depicts the item(s) in the opposite way. So, if its an item that is usually considered beautiful, they will try to convey it as not beautiful and if it is usually considered not beautiful, they will try to convey it as beautiful.</li>\n</ul>\n</section>","Belief Statement about Junior Learners":"<section><h3>Webquest &amp; Belief Statement Task</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"wbst-clps\"> <label for=\"wbst-clps\">Display task description</label>\n<blockquote>\n<p>In order to build a good foundation of knowledge about the junior student, your first activity will give you an opportunity to explore what the learning theorists have to say about the nature of the learner at this level.  Educational researchers have been working for many years to understand how learning occurs and what factors affect learning. Each research perspective provides insight about the learner, but more importantly it provides teachers with information about how to provide meaningful experiences for their students.  Knowledge of theories of learning helps teachers come to an understanding about their own beliefs about how children learn.</p>\n<p>To gather information about educational theorists, you will engage in an online webquest. To learn more about webquests go to: <a href=\"http://webquest.org/\">http://webquest.org/</a></p>\n<p>In this activity, you will take part in a short-term webquest. This is one style of webquest; as you learn more about webquests, you may find others types or ways of displaying information that are more suited to your teaching style.</p>\n<p>After reading about the various learning theorists, you will develop a belief statement about teaching and learning for the junior learner based on a learning theory that resonates with you. Belief statements are simply guiding principles that incorporate how your core beliefs about this age group could affect your teaching, particularly how you frame learning experiences.</p>\n</blockquote>\n</div>\n<p class=\"belief-statement\">I believe that at the Junior age group, we need to focus on including all students in our lessons. According to the Erik Erikson, it is important for students to feel a sense of accomplishment in their early development. In order to help each student feel this way, we need to make an effort to learn about our students’ likes and dislikes so that our lessons will engage students. It is also essential that we learn about their strengths and weaknesses so that we can modify our lessons around their specific needs.</p>\n</section>","Characteristics of Developmental Phases":"<section><h3>Development Phases</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"dp-clps\"> <label for=\"dp-clps\">Display task description</label>\n<blockquote>\n<p>Explore the following websites to gain a better grasp of the child between the ages of 8 and 12.</p>\n<p><strong>Canadian</strong> Resources:</p>\n<ul>\n<li><a href=\"http://www.growinghealthykids.com/english/home/index.html\">http://www.growinghealthykids.com/english/home/index.html</a></li>\n<li><a href=\"http://childparenting.about.com/od/physicalemotionalgrowth/\">Physical &amp; Emotional Growth -- Grade-schooler milestones</a></li>\n</ul>\n<p>These sites explore <strong>child development for different age ranges</strong>:</p>\n<ul>\n<li><a href=\"http://www.cyh.com/HealthTopics/HealthTopicDetails.aspx?p=114&amp;np=122&amp;id=1867\">Child Development 6 - 9 Years</a></li>\n<li><a href=\"http://childdevelopmentinfo.com/child-development/piaget\">Stages of Intellectual Development In Children and Teenagers</a></li>\n<li><a href=\"http://www.cyh.com/HealthTopics/HealthTopicDetails.aspx?p=114&amp;np=122&amp;id=1865\">Child development: 10-12 years</a></li>\n<li><a href=\"http://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/middle2.html\">Middle Childhood (9-11 years of age)</a></li>\n<li><a href=\"http://www.learner.org/series/discoveringpsychology/05/e05expand.html\">The Developing Child</a></li>\n</ul>\n<p>From your readings, complete a T-Chart about the physical, cognitive and social/emotional development of students at this age level.</p>\n<p>On the left side of the T-chart, list characteristics from each of the developmental areas and on the right, indicate implications for teaching.</p>\n</blockquote>\n</div>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Developmental Area</th>\n<th style=\"text-align:left\">Characteristics</th>\n<th style=\"text-align:left\">Teaching Considerations</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Physical</td>\n<td style=\"text-align:left\"><ul><li>Body Changes<ul><li>Growth, puberty, losing teeth, etc.</li></ul></li><li>Competitive<ul><li>Fine motor skills develop</li></ul></li></ul></td>\n<td style=\"text-align:left\"><ul><li>Include competitions in lessons</li><li>Be aware of students who are changing and provide support to students who may feel lost or out of place</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Cognitive</td>\n<td style=\"text-align:left\"><ul><li>Develop a capacity to reason</li><li>More independent from their family</li><li>Are able to see others' point of view more clearly</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Give students more independence</li><li>Incorporate more discussions in the classroom</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Social/Emotional</td>\n<td style=\"text-align:left\"><ul><li>Relationships become more complicated</li><li>May begin to worry about how others view them</li><li>Want to do things more independently</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Be aware of possible conflicts between students</li><li>Provide opportunities to show independence</li><li>Create an inviting and safe classroom environment</li></ul></td>\n</tr>\n</tbody>\n</table>\n</section>","Online and Print Resource Checklist":"<section><h3>Resource Checklist Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"resource-checklist-dp-clps\"> <label for=\"resource-checklist-dp-clps\">Display task description</label>\n<blockquote>\n<p>We also need to think about other resources that might be used to support a unit of study and determine guidelines for how to evaluate them. Read from each of the following three (3) sections of articles about assessing instructional resources in order to compile a resource checklist list.</p>\n<p>Create a checklist for evaluating resources you might use in your classroom. You might have a different checklist for using Internet sources than you would have when choosing print or video resources.</p>\n</blockquote>\n</div>\n<h4>Online Resource Checklist</h4>\n<table class=\"checklist\">\n   <tr>\n       <th colspan=\"2\">Accuracy</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information is correct and authentic.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information can be verified from other sources.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information can be verified and references are provided.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>There are no spelling, gramatical or typographical errors.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Authority</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The author and his/her credentials can be identified.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The author is affiliated to an academic institution or credible organization.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>An email address or some other contact information has been provided.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The domain name suggests that its a trusted source.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Currency</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The resource is dated and current.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The links are up to date and working.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information is current for the topic/research.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Purpose</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information on the website is appropriate for teaching purposes and not for commercial purposes.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It has links to other credible websites.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The point of view reflects no bias, ir objective and impartial.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Relevance</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information related to the topic and/or answers the question being researched.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content is age appropriate fo rhte students and devoid of inapproriate language or images.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The level of difficulty is appropriate for the grade.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content is presented in an interesting and easy-to-read fashion.</td>\n   </tr>\n   <tr>\n        <td>&#9633;</td>\n        <td>The site reflects Canadian values and identity.</td>\n   </tr>\n</table>\n<h4>Print Resource Checklist</h4>\n<table>\n   <tr>\n       <th colspan=\"2\">Quality of Content</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content has sound scholarship.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It has contemporary relevance and interests the students.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The depth of information and level of difficulty is grade appropriate.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The information builds on the prior knowledge of the students.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content reflects Canadian values and identity.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The ideas are presented without any biases.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Adaptability and Flexibility</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The book appears on the Ministry approved Trillium List (textbook only).</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content is based on the Ontario Curriculum.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The content and activities support varied instructional strategies.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It teaches/reinforces the stated goal well.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It has enough examples and practice exercices to reinforce concepts.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It allows students to make cross-curricular connections.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>It responds to the needs, interests and goals of the student.</td>\n   </tr>\n   <tr>\n       <th colspan=\"2\">Format</th>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The matter is logically organized and easy to follow for the students.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The text is supported by graphic elements.</td>\n   </tr>\n   <tr>\n       <td>&#9633;</td>\n       <td>The page layout is appealing and the font is easily readable.</td>\n   </tr>\n</table>\n</section>","Technology in the Junior Classroom":"<section><h3>Technologies</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"technologies-clps\"> <label for=\"technologies-clps\">Display task description</label>\n<blockquote>\n<p>One challenge for a junior teacher is to find and use technology in the classroom in a way that enhances his/her teaching.</p>\n<p>Read pages 74-75 in <a href=\"http://www.eworkshop.on.ca/edu/resources/guides/Guide_Lit_456_Vol_3_Planning.pdf\"><em>The Guide to Effective Literacy Instruction: Grades 4 to 6, Volume Three: Planning and Classroom Management</em></a></p>\n<p>Next, view three or four of the following articles/websites with information and strategies about using technology in a junior classroom (or do a search and find some yourself):</p>\n<ul>\n<li><a href=\"http://www.educationworld.com/a_tech/archives/technology.shtml\">Using Technology in the Classroom Archive</a></li>\n<li><a href=\"http://snow.idrc.ocad.ca/node/227\">Technology in the Classroom isn’t Utopia! It’s a must!</a></li>\n<li><a href=\"http://www.freetech4teachers.com/\">FreeTechnology for Teachers</a> by Richard Byrne</li>\n<li><a href=\"http://larryferlazzo.edublogs.org/\">Larry Ferlazzo’s Websites of the Day for Teaching ELL, ESL, &amp; EFL</a></li>\n<li><a href=\"http://edublogawards.com/\">The Edublog Awards Blog- with some Technology-Related Blogs</a></li>\n</ul>\n<p>Create a list of technologies that you would want to use in your classroom. Consider as many types of technology as you can, from overhead projectors and audio recorders, to Smart Boards, and DVD players. Beside each item, indicate how it was used. As a reflective exercise, rate your comfort level with the technology using poor, good or excellent.</p>\n</blockquote>\n</div>\n<p>I feel comfortable with most technolgies that are available for the classroom. However, for the technologies that I have not experienced before, I would like to believe that I am able to quickly adapt and learn how to use something new.</p>\n<table>\n<thead>\n<tr>\n<th>Technology</th>\n<th style=\"text-align:left\">Uses and Thoughts</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>SMART Boards</td>\n<td style=\"text-align:left\">The SMART Board has many uses, from a projector for a classroom computer to an interactive station in a center-based classroom. Many times, these boards are not much more than glorified overhead projectors or chalkboards. For the technology to be transformative, teachers need to allow students to use the boards for learning activities, in small groups if possible.</td>\n</tr>\n<tr>\n<td>Laptops/Tablets</td>\n<td style=\"text-align:left\">Laptops, Chromebooks or tablets are a great way for students to learn on the move. These are used for everything from simple access to resources for learning, to creating products that demonstrate their learning and understanding in ways that best suit them.</td>\n</tr>\n<tr>\n<td>Hardware</td>\n<td style=\"text-align:left\">A well-equiped classroom should have many types of hardware such as microphones and headsets for audio listening and creation, digital cameras (still and video) for students to capture their thoughts and daily learning.</td>\n</tr>\n<tr>\n<td>Google Documents</td>\n<td style=\"text-align:left\">This tool allows collaboration between students in a completely new way. When assigning group/partner work, ask the students to put their work into a Google Doc.</td>\n</tr>\n<tr>\n<td>Skype</td>\n<td style=\"text-align:left\">Skype is a great way to have students interact with people from outside your area. If it not feasible for guest speakers to visit your school, you can use Skype to have them speak to your class that way instead.</td>\n</tr>\n<tr>\n<td>Class Website</td>\n<td style=\"text-align:left\">Starting a class website with general information, homework postings and lesson information is definitely a must-do for every teacher. This platform of communication allows the teacher to post important information for the class</td>\n</tr>\n<tr>\n<td>Socrative</td>\n<td style=\"text-align:left\">Socrative is an app/website that lets teachers engage and assess their students with educational activities on tablets, laptops and smartphones. They use real-time questioning, instant result aggregation and visualization to help the teacher guage the whole class' current level of understanding.</td>\n</tr>\n</tbody>\n</table>\n</section>"},"Professional Knowledge":{"Big Ideas and Problem Solving in Junior Math":"<section><h3>Big Ideas and Problem Solving in Junior Math Instruction</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"biapsijmi-clps\"> <label for=\"biapsijmi-clps\">Display task description</label>\n<blockquote>\n<p>Using <em>The Guide to Effective Instruction in Mathematics, Kindergarten to Grade 6, Volume 2: Problem Solving and Communication</em> and the e-workshop site on &quot;Big Ideas and Problem Solving&quot; , write a 1 to 2 page paper or create a 10-15 slide PowerPoint presentation on the use of &quot;Big Ideas&quot; and &quot;Problem Solving&quot; in junior math instruction.</p>\n<p>Your presentation should include:</p>\n<ol>\n<li>An explanation of the concepts of “Big Ideas” and a &quot;Problem Solving Approach&quot;.</li>\n<li>An explanation of why the problem solving approach is important to the development and understanding of “Big Ideas”.</li>\n<li>Information about classroom structures that support problem solving.</li>\n<li>Information about the importance of communication in problem solving.</li>\n<li>A list of resources and strategies that teachers can use to further develop their understanding.</li>\n</ol>\n</blockquote>\n</div>\n<figure align=\"middle\">\n    <img src=\"prezi-thumbnail.png\" alt=\"Big Ideas Prezi Thumbnail\" style=\"width:75%;height:75%\">\n    <figcaption>Please click the following link to view the presentation. <br><a href=\"http://prezi.com/t9aclowijeur/?utm_campaign=share&utm_medium=copy&rc=ex0share\">Big Ideas & Problem Solving Prezi</a></figcaption>\n</figure>\n</section>","Big Ideas for Each Junior Subject":"<section><h3>Big Ideas Chart</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"bic-clps\"> <label for=\"bic-clps\">Display task description</label>\n<blockquote>\n<p>It is important to understand the overall concepts/topics that are being taught in any grade for each of the subjects.</p>\n<p>Look through the documents at the junior level and complete the Big Idea Chart for the topics covered. You will be recording the names of the large topics for each document only. There are a couple of entries to help you get started but you will need to add more information.</p>\n</blockquote>\n</div>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\"><em>Subject</em></th>\n<th style=\"text-align:left\"><em>Grade 4</em></th>\n<th style=\"text-align:left\"><em>Grade 5</em></th>\n<th style=\"text-align:left\"><em>Grade 6</em></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><em>Dance</em></td>\n<td style=\"text-align:left\"><ul><li>Create short dance pieces</li><li>Analyse and communicate feelings and ideas</li><li>Understand cultural dance forms and traditions</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Create short dance pieces while incorporating elements of dance (body, space, time, energy, relationship)</li><li>Analyse and communicate feelings and ideas</li><li>Understand cultural dance forms and traditions</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Create short dance pieces while incorporating elements of dance (body, space, time, energy, relationship)</li><li>Use props and materials to depict central themes in literature, pop culture, etc.</li><li>Analyse and communicate feelings and ideas</li><li>Understand cultural dance forms and traditions</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Drama</em></td>\n<td style=\"text-align:left\"><ul><li>Engage in dramatic play</li><li>Analyse drama and communicate ideas</li><li>Understand cultural forms of drama</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Engage in dramatic play</li><li>Analyse drama and communicate ideas</li><li>Understand cultural forms of drama</li><li>Incorporate elements of drama (role/character, relationship, time and place, tension, focus and emphasis)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Engage in dramatic play</li><li>Analyse drama and communicate ideas</li><li>Understand cultural forms of drama</li><li>Incorporate elements of drama (role/character, relationship, time and place, tension, focus and emphasis)</li><li>Focus on themes, issues and ideas</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Music</em></td>\n<td style=\"text-align:left\"><ul><li>Read standard notation</li><li>Create and perform music</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Read simple musical notation</li><li>Create and perform music</li></td>\n<td style=\"text-align:left\"><ul><li>Read and perform from musical notation</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Visual Arts</em></td>\n<td style=\"text-align:left\"><ul><li>Create, analyse and reflect on visual art</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Create, analyse and reflect on visual art while incorporating elements of design (line, shape/form, space, colour, texture, value)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Create, analyse and reflect on visual art while incorporating elements of design (line, shape/form, space, colour, texture, value) and focusing on themes, issues and ideas</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Health &amp; Physical Education</em></td>\n<td style=\"text-align:left\"><ul><li>Understand active, healthy lifestyle and a wide variety of activities</li><li>Describe livings skills, active living, movement and health</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Understand active, healthy lifestyle and a wide variety of activities and focus on physical, cognitive and emotional domains</li><li>Describe livings skills, active living, movement and health</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Understand active, healthy lifestyle and a wide variety of activities and focus on physical, cognitive and emotional domains</li><li>Describe livings skills, active living, movement and health</li><li>Learn to take responsibility for their own health and fitness</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Language</em></td>\n<td style=\"text-align:left\"><ul><li>Oral communication, reading, writing and media literacy</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Oral communication, reading, writing and media literacy with purpose, comprehension and extension</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Oral communication, reading, writing and media literacy with purpose, comprehension and extension</li><li>Focus on meaning and an emphasis on reflection and metacognition</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Mathematics</em></td>\n<td style=\"text-align:left\"><ul><li>Decimals and fractions (addition and subtraction)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Decimals and fractions (multiplication and division)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Decimals, percent, rate and ratios and predict frequency of outcome</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Science &amp; Technology</em></td>\n<td style=\"text-align:left\"><ul><li>Life systems (habitats and communities)</li><li>Structures and mechanics (pulleys and gears)</li><li>Matter and energy (light and sounds)</li><li>Earth and space (rocks and minerals)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Life systems (human organs)</li><li>Structures and mechanics (forces acting on structures and mechanisms)</li><li>Matter and energy (properties and changes in matter)</li><li>Earth and space (conservation of energy and resources)</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Life systems (biodiversity)</li><li>Structures and mechanics (flight)</li><li>Matter and energy (electricity and electrical devices)</li><li>Earth and space (space)</li></ul></td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><em>Social Studies</em></td>\n<td style=\"text-align:left\"><ul><li>Provinces, territories and regions of Canada</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Citizenship and government in Canada</li></ul></td>\n<td style=\"text-align:left\"><ul><li>Canada's links to the world</li></ul></td>\n</tr>\n</tbody>\n</table>\n</section>","Bloom's Taxonomy":"<section><h3>Bloom's Taxonomy Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"btdp-clps\"> <label for=\"btdp-clps\">Display task description</label>\n<blockquote>\n<p>There are many variations of Bloom's Taxonomy. Please visit the following websites to learn more about Bloom's Taxonomy and ways to apply it in your classroom.</p>\n<ul>\n<li><a href=\"http://larryferlazzo.edublogs.org/2009/05/25/the-best-resources-for-helping-teachers-use-blooms-taxonomy-in-the-classroom/\">The Best Resources for Helping Teachers Use Bloom's Taxonomy in the Classroom</a></li>\n<li><a href=\"http://www.learningandteaching.info/learning/bloomtax.htm\">Bloom's Taxonomy - Learning and Teaching</a></li>\n<li><a href=\"http://projects.coe.uga.edu/epltt/index.php?title=Bloom%27s_Taxonomy\">Bloom's Taxonomy - The University of Georgia</a></li>\n</ul>\n<p>Here are other useful resources that offer teaching strategies and tools for fostering thinking skills in the classroom:</p>\n<ul>\n<li><a href=\"http://www.edu.gov.on.ca/eng/literacynumeracy/inspire/research/CBS_AskingEffectiveQuestions.pdf\">Asking Effective Questions</a>, from the Literacy and Numeracy Series</li>\n<li><a href=\"http://www.edu.gov.on.ca/eng/literacynumeracy/FractionsResponsive.pdf\">Being Responsive to Student Thinking</a>, from the Literacy and Numeracy Series</li>\n<li><a href=\"http://www.edu.gov.on.ca/eng/literacynumeracy/inspire/research/CBS_InquiryBased.pdf\">Critical Literacy</a>, from the Literacy and Numeracy Series</li>\n<li><a href=\"http://tc2.ca/sources.php\">The Critical Thinking Consortium</a>, under Teaching Resources</li>\n</ul>\n<p>Review the Achievement Chart criteria for thinking. How can you incorporate some of the ideas from this research into your daily teaching? Choose one idea to explore and share it.</p>\n</blockquote>\n</div>\n<p class=\"pull-left\"><img src=\"blooms_taxonomy.small.jpg\" alt=\"Bloom's Taxonomy\"></p>\n<p>I learned that there are many variations of Bloom's Taxonomy while I was visiting several website to learn about how to apply it in my classroom. Essentially, Bloom's Taxonomy is a classification of learning objectives within education. It divides these objectives into three domains - cognitive, affective and psychomotor (knowing, feeling and doing).</p>\n<p>I was able to see some clear and logical connections, after revisiting the achievement charts in the Ontario Curriculum. For example, &quot;remember&quot; and &quot;understand&quot; in the Taxonomy sounds similar to &quot;knowledge and understanding&quot;. This leads to &quot;apply&quot; and then &quot;analyze, evaluate, create&quot; which in my opinion, sounds very simliar to our achievement chart in Ontario!</p>\n</section>","Grade 6 Space Unit Outline":"<section><h3>Grade 6 Space Unit Plan</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"g6sup-clps\"> <label for=\"g6sup-clps\">Display task description</label>\n<blockquote>\n<p>Read pages 28 to 38 in <a href=\"http://www.eworkshop.on.ca/edu/resources/guides/Guide_Lit_456_Vol_3_Planning.pdf#page=34\"><em>The Guide to Effective Literacy Instruction: Grades 4 to 6, Volume Three: Planning and Classroom Management</em></a></p>\n<p>From all the information you have discovered about the curriculum at the junior level, you will need to choose a method of integrating curriculum. Remember that integration is not just about choosing a theme and making it cross-curricular. Think about the article by Nicola Findley to help you in your decision making.</p>\n<p>How many expectations go into one unit of study? That is a difficult question to answer with an exact number. One factor is how much time you are allowing for a particular unit in your timetable. If you are doing a cross-curricular unit and have allowed all morning or afternoon for a week or 10 days, this will give you an opportunity to address more expectations than a unit that is taking one period a day for one week.</p>\n<p>A second consideration is how the specific expectations are listed in the documents. The specific expectations provide information about the scope of the overall expectations. Is this a brand new topic for students? Is this a topic that is building upon the work done in previous years or in this grade? Is the scope of the topic narrow or broad? What do the specific expectations tell me about the depth that the topic is expected to cover at this grade level?</p>\n<p>When designing the unit, you will focus on the overall expectations as the goal and the specific expectations will be the scaffolding you will use to move your students toward that goal.</p>\n<p>For this task:</p>\n<ol>\n<li>\n<p>You will select a grade, subject area and a specific unit\\topic of study for your unit outline (Eg, Grade 6 Science, Diversity of Living Things).</p>\n</li>\n<li>\n<p>Then, decide on the cluster of expectations (first overall expectations that work well together and then specific expectations that address the overall expectations) for your unit outline. Be sure to include a rationale for the choices you are making.</p>\n</li>\n<li>\n<p>Decide on the timeframe.</p>\n</li>\n<li>\n<p>Over the next two modules, you will be doing some assignments related to the topic and expectations you have chosen.</p>\n</li>\n<li>\n<p>Looking at your chosen expectations, make notes about which learning skills you will include in your unit, and how you can incorporate any of the valuable messages from the <a href=\"http://www.edu.gov.on.ca/eng/document/policy/cps/CreatingPathwaysSuccess.pdf\"><em>Creating Pathways to Success</em></a> document.</p>\n</li>\n<li>\n<p>Consider how you will integrate.</p>\n</li>\n</ol>\n</blockquote>\n</div>\n<ul class=\"inline-items\">\n<li><em>Unit Plan Title:</em> Space</li>\n<li><em>Grade:</em> 6</li>\n<li><em>Subject(s):</em> Science and Technology</li>\n<li><em>Term:</em> 2</li>\n<li><em>Unit Length:</em> 6-7 weeks</li>\n<li><em>Cross-Curricular Connections:</em> Language, Arts</li>\n</ul>\n<h4>Curriculum Expectations</h4>\n<h5>Overall Expectations</h5>\n<ul>\n<li>assess the impact of space exploration on society and the environment</li>\n<li>investigate characteristics of the systems of which the earth is a part and the relationship between the earth, the sun, and the moon</li>\n<li>demonstrate an understanding of components of the systems of which the earth is a part, and explain the phenomena that results from the movement of different bodies in space</li>\n</ul>\n<h5>Specific Expectations</h5>\n<ol>\n<li>Relating Science and Technology to Society and the Environment\n<ol class=\"sectional\">\n<li>assess the contributions of Canadians to the exploration and scientific understanding of space</li>\n<li>evaluate the social and environmental costs and benefits of space exploration, taking different points of view into account</li>\n</ol>\n</li>\n<li>Developing Investigation and Communication Skills\n<ol class=\"sectional\">\n<li>follow established safety procedures for handling tools and materials and observing the sun</li>\n<li>use technological problem-solving skills to design, build and test devices for investigating the motions of different bodies in the solar system</li>\n<li>use scientific inquiry/research skills to investigate scientific and technological advances that allow humans to adapt to life in space</li>\n<li>use appropriate science and technology vocabulary, including axis, tilt, rotation, revolution, planets, moon, comets, and asteroids, in oral and written communication</li>\n<li>use a variety of forms to communicate with different audiences and for a variety of purposes</li>\n</ol>\n</li>\n<li>Understanding Basic Concepts\n<ol class=\"sectional\">\n<li>identify components of the solar system, including the sun, the earth, and other planets, natural satellites, comets, asteroids, and meteoroids, and describe their physical characteristics in qualitative terms</li>\n<li>identify the bodies in space that emit light and those that reflect light</li>\n<li>explain how humans meet their basic biological needs in space</li>\n<li>identify the technological tools and devices need for space exploration</li>\n<li>describe the effects of the relative positions and motions of the earth, moon and sun</li>\n</ol>\n</li>\n</ol>\n</section>","Shared Reading Lesson":"<section><h3>Shared Reading Literacy Lesson Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"srlldp-clps\"> <label for=\"srlldp-clps\">Display task description</label>\n<blockquote>\n<p>Go to <a href=\"http://www.eworkshop.on.ca\">http://www.eworkshop.on.ca</a> to Literacy Modules: Grades 4 to 6: Shared Reading.</p>\n<p>Work through the &quot;Let Me Try&quot; section of this module.</p>\n<ul>\n<li>From this experience develop a shared reading lesson plan on one of the following genres or formats – electronic text, poetry, or informational text (not a novel study.. novel studies are covered under litterature circles). You can find a lesson plan template at <a href=\"http://www.eworkshop.on.ca/cfmx/edu/pdf/Mod21_5day_lessonplan.pdf\">http://www.eworkshop.on.ca</a>. This template is a 5 day lesson plan and your lesson may take less time than this. Please complete the introductory lesson in detail and then give a more general indication of the flow of the topic from that point for subsequent days.</li>\n<li>Indicate the grade and include specific strategies used.</li>\n</ul>\n</blockquote>\n</div>\n<p class=\"pull-right\"><img src=\"SpringSummerAutWinter.thumb.jpg\" alt=\"Spring Summer Autumn Winter\"></p>\n<h4>Title</h4>\n<p><em>Spring Summer Autumn Winter</em> by Diane Siebert (Book of 4 Poems)</p>\n<h4>Key Understandings</h4>\n<p>The focus of this lesson will be to help students to analyze the use of literary devices such as rhyme, word play, imagery and rhythm and how to compare what they read with their personal experiences.</p>\n<h4>Assessment</h4>\n<ul>\n<li>Note student involvement during oral discussions</li>\n<li>Hand in Venn diagram activity</li>\n</ul>\n<h4>Prior Knowledge</h4>\n<p>Students will have a basic understanding of poetry and poetry strategies.</p>\n<h4>Teaching Focus/Curriculum Expectations</h4>\n<p><em>Students will:</em></p>\n<ul>\n<li>\n<p>1.1 Read a variety of texts from diverse cultures, including literacy texts.</p>\n</li>\n<li>\n<p>1.6 Extend understandings of texts by connecting the ideas to their own knowledge, experience, and insights to other familiar texts, and to the world around them.</p>\n</li>\n<li>\n<p>2.4 Identify various elements of style – including word choice and the use of similes, personification, comparative adjectives, and sentences of different types, lengths and structures – and explain how they help communicate meaning.</p>\n</li>\n</ul>\n<h4>Teaching Strategies</h4>\n<ul>\n<li>Whole group discussion</li>\n<li>Venn diagram to compare two poems</li>\n<li>Think-Pair-Share, elbow partners, small groups</li>\n</ul>\n<h4>Materials/Preparation for Teaching</h4>\n<ul>\n<li>The poems electronically or printed for a SmartBoard or document camera</li>\n<li>A copy of both poems for each student</li>\n<li>Copy of a fillable Venn diagram for each student</li>\n</ul>\n<h4>Instruction - Day 1: Summer (p. 10-15)</h4>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Time Frame</th>\n<th style=\"text-align:left\">Instruction</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Before Reading</td>\n<td style=\"text-align:left\">Before beginning, tell students to listen to the sounds of the poem. Tell them to take note of the words that the poet chooses. Inform them that poets use different literary devices to create images in the reader’s mind.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">During Reading</td>\n<td style=\"text-align:left\">Read &quot;Summer&quot;, p 11-13. Make sure you help students observe punctuation as you read. The punctuation also gives the poem its rhythm. It would be a good idea to read the poem in advance (before reading with the class) in order to become familiar with the rhythms and unusual wordplay. <br><br class=\"sbreak\"> Make sure you help students with challenging vocabulary. Use difficult words from the text in conversation to help students determine a definition that they can understand.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">After Reading</td>\n<td style=\"text-align:left\">Once finished reading the poem, highlight the literary devices that the author uses. Examples - rhyming words, alliteration, etc.</td>\n</tr>\n</tbody>\n</table>\n<h4>Instruction - Day 2: Winter (p. 22-31)</h4>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Time Frame</th>\n<th style=\"text-align:left\">Instruction</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Before Reading</td>\n<td style=\"text-align:left\">Guide a discussion to help students reflect on the previous poem about summer and brainstorm some of their favourite parts. Then describe what your focus is going to be for the day. Encourage questions and responses from your students throughout the lesson.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">During Reading</td>\n<td style=\"text-align:left\">Read &quot;Winter&quot;, p 22-31. As you read, get students to reflect on the images that are being created.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">After Reading</td>\n<td style=\"text-align:left\">Provide an opportunity for students to discuss any new words or phrases that may have come up in the poem. Ask students to share any experiences they’ve had with winter and if the poem’s images connected with any of their experiences.</td>\n</tr>\n</tbody>\n</table>\n<h4>Instruction - Day 3: p.11-14, 22-25</h4>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Time Frame</th>\n<th style=\"text-align:left\">Instruction</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Rereading</td>\n<td style=\"text-align:left\">Introduce the focus for the lesson. Reread p 11-13. Then guide a discussion of the opinions and view of summer that were introduced. Then reread p 22-25. Help guide a discussion about how to compare the poet’s views of summer and winter.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">After Reading</td>\n<td style=\"text-align:left\">Create a Venn diagram to demonstrate visual comparisons between the two poems. Guide students to help them understand how using a graphic organizer can help organize their thinking. <br><br class=\"sbreak\">You can also pick out a word from the poems to help define and review the meaning of a preposition.</td>\n</tr>\n</tbody>\n</table>\n<h4>Reflection</h4>\n<p>Were my students successful? What worked well? What should I change for future lessons?</p>\n</section>"},"Professional Practice":{"Achievement Chart Activities":"<section><h3>Achievement Charts Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"acdp-clps\"> <label for=\"acdp-clps\">Display task description</label>\n<blockquote>\n<p>Read the introduction to the achievement charts (and samples) on page 16 of <a href=\"http://www.edu.gov.on.ca/eng/policyfunding/growSuccess.pdf#page=22\">Growing Success: Assessment, Evaluation, and Reporting in Ontario Schools</a>.</p>\n<p><strong>Thinking about your unit</strong>, complete the Achievement Chart Activites, detailing the tasks you might use a particular catergory of knowledge and skill. You will note that an example has been provided in each category.</p>\n</blockquote>\n</div>\n<table class=\"tchart\">\n    <tr>\n        <th>Achivevement Chart Category</th>\n        <th>Types of Activities</th>\n    </tr>\n    <tr>\n        <td><i>Knowledge and Understanding</i></td>\n        <td>\n            <ul>\n                <li>True/False questions</li>\n                <li>Fill in the blank</li>\n                <li>Matching</li>\n                <li>Short answer questions</li>\n                <li>Labelling diagrams</li>\n                <li>Mind maps</li>\n                <li>Jeopardy game</li>\n            </ul>\n        </td>\n    </tr>\n    <tr>\n        <td><i>Thinking</i></td>\n        <td>\n            <ul>\n                <li>Storyboard</li>\n                <li>Four corners activity</li>\n                <li>Brainstorming</li>\n                <li>Debates</li>\n                <li>Creating an advertisement</li>\n            </ul>\n        </td>\n    </tr>\n    <tr>\n        <td><i>Communication</i></td>\n        <td>\n            <ul>\n                <li>Organization of visuals on a poster</li>\n                <li>PowerPoint presentation</li>\n                <li>Oral presentation</li>\n                <li>Use of appropriate word choice and style in a written assignment</li>\n            </ul>\n        </td>\n    </tr>\n    <tr>\n        <td><i>Application</i></td>\n        <td>\n            <ul>\n                <li>Writing a journal from the view of a historical space figure</li>\n                <li>Writing a song</li>\n                <li>Creating a play</li>\n                <li>Creating a documentary</li>\n                <li>Writing a story</li>\n                <li>Creating a model/diorama</li>\n            </ul>\n        </td>\n    </tr>\n</table>\n</section>","Grade 6 Space Culminating Task":"<section><h3>Culminating Task Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"ctdp-clps\"> <label for=\"ctdp-clps\">Display task description</label>\n<blockquote>\n<p>From the knowledge you have gained, plan a final task for your unit including how it will be assessed. Be sure to make notes about your task that will help you articulate why you are doing what you are doing.</p>\n</blockquote>\n</div>\n<h4>Task</h4>\n<p>Students will work in groups to create a short film about a topic in the Space unit. Some topics to choose from are listed:</p>\n<ul>\n<li>Components of the Solar System\n<ul>\n<li>Planets and their moons</li>\n<li>Comets</li>\n<li>The Sun</li>\n<li>Asteroids</li>\n</ul>\n</li>\n<li>Meeting Human Needs in Space</li>\n<li>The Earth, Sun, Moon System</li>\n<li>Technological Tools for Space Exploration</li>\n<li>Contribution of Canadians to Space Exploration</li>\n<li>Social and Environmental Costs of Space Exploration</li>\n<li>Another idea, which must be approved by your teacher</li>\n</ul>\n<h4>Assessment</h4>\n<p>Students will be given a self-assessment checklist. This will help ensure that students have completed all of the components of the task. A task rubric will be used for Summative assessment. Both will be given to students at the beginning of the unit along with the culminating task handouts.</p>\n<h4>Timeline</h4>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Step</th>\n<th style=\"text-align:left\">Minutes</th>\n<th style=\"text-align:left\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Storyboard</td>\n<td style=\"text-align:left\">40</td>\n<td style=\"text-align:left\">Students will create a storyboard to outline the basic sequence of scenes in their documentary.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Script</td>\n<td style=\"text-align:left\">150</td>\n<td style=\"text-align:left\">Students will name the characters in their documentary and create a script of dialogue and stage direction.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Filming</td>\n<td style=\"text-align:left\">150</td>\n<td style=\"text-align:left\">Students will use available technology to film their scenes using props.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Editing</td>\n<td style=\"text-align:left\">100</td>\n<td style=\"text-align:left\">Students will use computers or iPads to edit the video clips to create their final project.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Viewing</td>\n<td style=\"text-align:left\">60</td>\n<td style=\"text-align:left\">Students will show their documentaries to the class.</td>\n</tr>\n</tbody>\n</table>\n<h4>Required Materials</h4>\n<ul>\n<li>Storyboard blanks</li>\n<li>Video cameras</li>\n<li>Props</li>\n<li>Computers/iPads</li>\n</ul>\n<h4>Prior Knowledge</h4>\n<p>Students will have:</p>\n<ul>\n<li>learned the topics from the Space unit from the science curriculum;</li>\n<li>studied the basic components of a documentary film;</li>\n<li>studied the components of a script;</li>\n<li>studied the elements of dramatic presentation;</li>\n<li>viewed sample mini documentaries.</li>\n</ul>\n</section>","Graphic Organizers":"<section><h3>Graphic Organizers Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"godp-clps\"> <label for=\"godp-clps\">Display task description</label>\n<blockquote>\n<p>The following websites have a variety of useful graphic organizers:</p>\n<ul>\n<li><a href=\"http://www.realclassroomideas.com/65.html\">http://www.realclassroomideas.com/65.html</a></li>\n<li><a href=\"http://www.teach-nology.com/worksheets/graphic\">http://www.teach-nology.com/worksheets/graphic</a></li>\n</ul>\n<p>Use one of these websites to find a graphic organizer that you have not previously used in a classroom, but would consider using for the unit of study you are working on in this course. Write about this new type of organizer using the following guiding questions:</p>\n<ol>\n<li>How will you use this organizer in your unit of study?</li>\n<li>What are the benefits of this graphic organizer?</li>\n<li>What are the limitations of this organizer?</li>\n<li>Include a sample of the organizer (if possible).</li>\n</ol>\n</blockquote>\n</div>\n<p>This graphic organizer is a film strip sequencing organizer. I would give this to the students to use during the storyboard stage of the Grade 6 Space unit culminating task.</p>\n<p>It would be a great tool to use in order to organize their group’s thinking for their culminating task. There are many different types of graphic organizers that can help with this step, but what I liked the most about this one is its film strip theme.</p>\n<p>However, I would only offer this graphic organizer as a page for students to gather their initial ideas. This would not be an appropriate graphic organizer to coordinate a final script because of its lack of space for writing.</p>\n<p>This graphic organizer can be found at the following link: <a href=\"http://www.realclassroomideas.com/resources/graphic+organizers-filmstripsequencing.pdf\">Filmstrip Sequencing</a>.</p>\n<p><iframe src=\"pdf.js/web/viewer.html?file=/graphic_organizer_filmstrip.pdf\" width=\"100%\" height=\"550px\"></iframe></p>\n</section>","Types of Diagnostic Assessment":"<section><h3>Diagnostic Assessment Discussion Post</h3>\n<div class=\"taskbox\">\n<input type=\"checkbox\" id=\"dadp-clps\"> <label for=\"dadp-clps\">Display task description</label>\n<blockquote>\n<p><strong>When beginning a new unit or topic it is valuable to find out the prior knowledge of students the week prior to beginning your new unit.</strong> It is very important to have time to adjust the front end of your unit to either compact the material, if students already have a good understanding of the topic, OR to incorporate a review section at the beginning of the unit to build the lead-up to your unit. There is nothing worse than having students who are lost at the beginning of a unit because diagnostic information was not gathered and addressed.</p>\n<p>Consider the following questions related to diagnostic assessment:</p>\n<ul>\n<li>How can you perform diagnostic assessment for your unit of study?</li>\n<li>What type of task might include parents in a diagnostic assessment?</li>\n<li>What types of things can you do to adjust the beginning of a unit?</li>\n</ul>\n<p>Create a list of ideas about the types of diagnostic assessment that should be used prior to beginning your particular unit. Include suggestions for changes that may need to be made based on data gathered through the diagnostic assessment processes you are proposing.</p>\n</blockquote>\n</div>\n<h4>How can you perform diagnostic assessment for your unit of study?</h4>\n<p>There are a variety of assessment strategies that are currently used by teachers to evaluate their students’ prior knowledge of a particular subject. Some examples of diagnostic assessments are:</p>\n<ul class=\"inline-items\">\n<li>Journals</li>\n<li>Graphic organizers</li>\n<li>Pre-tests</li>\n<li>KWL activity</li>\n<li>Surveys</li>\n<li>Performance task</li>\n<li>Mind map</li>\n<li>Conference</li>\n<li>Graffiti wall</li>\n</ul>\n<p>Within my unit of study, I would use:</p>\n<ul>\n<li><em>KWL activity</em> - Ask students to create an organizational tool, in order to indicate what they know, what they want to know and what they have learned. This allows students to reflect back on their original knowledge and comment on their learning process.</li>\n<li><em>Journals</em> - The journal activity would allow me to assess their current knowledge before an activity and help formulate changes in future activities.</li>\n<li><em>Graffiti Wall</em> - This tool would allow students to start thinking about the language that they will be exposed to, and help me determine their current knowledge of key terms.</li>\n</ul>\n<h4>What type of task might include parents in a diagnostic assessment?</h4>\n<p>As mentioned previously, communication with parents is extremely important in order to make sure that each student is supported at school and at home. By providing a diagnostic assessment to parents, it would enable the teacher to communicate the goals that are being set in the classroom, as well as provide an opportunity to receive feedback information that would allow for a more holistic picture of how the student is supported. For my class in particular, I would use hard print and electronic media to send home parent surveys, questionnaires and diagnostic assessment tools.</p>\n<h4>What types of things can you do to adjust the beginning of a unit?</h4>\n<p>If the students are further ahead than anticipated:</p>\n<ul>\n<li>make my first lesson more condensed than original plan and maybe even remove some information that the students already know</li>\n<li>spend less time on concepts that the students know already, just briefly mention them instead or remove them completely</li>\n</ul>\n<p>If the students are further behind than anticipated:</p>\n<ul>\n<li>add another lesson which is a &quot;review&quot; class</li>\n<li>have students research information about the missing topics online or in books</li>\n</ul>\n</section>"}}
